tap "daipeihust/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "lihaoyun6/tap"
tap "linux-china/tap"
tap "localsend/localsend"
tap "mrkai77/cask"
tap "pot-app/tap"
tap "umlx5h/tap"
tap "v2raya/v2raya"
# Extremely Fast Compression algorithm
brew "lz4"
# General-purpose data compression with high compression ratio
brew "xz"
# TIFF library and utilities
brew "libtiff"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Download with resuming and segmented downloading
brew "aria2"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Software library to render fonts
brew "freetype"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core utilities for Python packages
brew "python-packaging"
# Core application library for C
brew "glib"
# Binary installation for rust projects
brew "cargo-binstall"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# OpenType text shaping engine
brew "harfbuzz"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Change Source for every software on every platform from the command-line
brew "chsrc"
# Cut, copy, and paste anything, anywhere, all from the terminal
brew "clipboard"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pluggable and configurable code formatting platform written in Rust
brew "dprint"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Tool to install, manage and use Progressive Web Apps in Mozilla Firefox
brew "firefoxpwa"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Sharp cut(1) clone
brew "hck"
# Command-line hex viewer
brew "hexyl"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Command-line pager for JSON data
brew "jless"
# Interactive JSON filter using jq
brew "jnv"
# JSON output from a shell
brew "jo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Common error values for all GnuPG components
brew "libgpg-error"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2@1.7"
# Powerful, lightweight programming language
brew "lua"
# Rime Input Method Engine
brew "librime"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Unix documentation system
brew "man-db"
# Drop-in replacement for MySQL
brew "mariadb"
# Mac App Store command-line interface
brew "mas"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Very basic terminfo library
brew "unibilium"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Command-line Git information tool
brew "onefetch"
# Painless compression and decompression for your terminal
brew "ouch"
# Shell command parallelization utility
brew "parallel"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm"
# Modern replacement for ps written in Rust
brew "procs"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Implementation of Python 3 in Python
brew "pypy3.10"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line tool to batch rename files and directories
brew "rnr"
# Utility that provides fast incremental file transfer
brew "rsync"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Run commands in parallel with Rust's Tokio framework
brew "rust-parallel"
# Adds numbered shortcuts for common git commands
brew "scmpuff"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Cross-shell prompt for astronauts
brew "starship"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# SSH Lightweight management tools
brew "tssh"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Platform for building proxies to bypass network restrictions
brew "v2ray"
# Version manager with support for Java, Node.js, Flutter, .NET & more
brew "vfox"
# Modern watch command
brew "viddy"
# Next generation frontend tooling. It's fast!
brew "vite"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Switch your input method through terminal
brew "daipeihust/tap/im-select"
# An efficient Awk-like language implementation by Rust with stdlib
brew "linux-china/tap/zawk"
# A Trash CLI manager written in Go
brew "umlx5h/tap/gtrash"
# Web-based GUI client of Project V
brew "v2raya/v2raya/v2raya"
# GPU-accelerated terminal emulator
cask "alacritty"
# Enable Windows-like alt-tab
cask "alt-tab"
# Cloud storage service
cask "baidunetdisk"
# Dictionary and translator app
cask "easydict"
# Screen colour temperature controller
cask "flux"
cask "font-jetbrains-mono-nerd-font"
# Download accelerator and organiser
cask "free-download-manager"
# Utility to provide quick look previews for files that aren't natively supported
cask "glance-chamburr"
# Desktop automation application
cask "hammerspoon"
# Free and open-source media player
cask "iina"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# Window manager
cask "loop"
# Syncs files between computers and MEGA Cloud drives
cask "megasync"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Email client
cask "microsoft-outlook"
# Neovim Client
cask "neovide"
# Music streaming platform
cask "neteasemusic"
# Free and open-source RSS reader
cask "netnewswire"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Document editor
cask "onlyoffice"
# Screenshot tool
cask "pixpin"
# A lightweight and high-performance screen recorder for macOS.
cask "quickrecorder"
# Control your tools with a few keystrokes
cask "raycast"
# GUI for rsync
cask "rsyncui"
# System monitor for the menu bar
cask "stats"
# Real time file synchronisation software
cask "syncthing"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Pin any window to the top of your screen.
cask "topit"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Gecko based web browser
cask "zen-browser"
mas "Picview", id: 6452016140
vscode "alefragnani.bookmarks"
vscode "bajdzis.vscode-database"
vscode "batisteo.vscode-django"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "clarkyu.vscode-sql-beautify"
vscode "continue.continue"
vscode "cweijan.vscode-office"
vscode "dbaeumer.vscode-eslint"
vscode "doggy8088.quicktype-refresh"
vscode "donjayamanne.githistory"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "hediet.debug-visualizer"
vscode "humao.rest-client"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "ivory-lab.jenkinsfile-support"
vscode "kaiyi.qwerty-learner"
vscode "liulongbin1314.escook-translate"
vscode "mads-hartmann.bash-ide-vscode"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "naumovs.color-highlight"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.vscode-yaml"
vscode "saoudrizwan.claude-dev"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "xyz.local-history"
vscode "yinfei.luahelper"
vscode "zxh404.vscode-proto3"
