tap "brewforge/chinese"
tap "brewforge/extras"
tap "lihaoyun6/tap"
tap "oven-sh/bun"
tap "v2raya/v2raya"
tap "xo/xo"
tap "ybeapps/sourcegit"
# Extremely Fast Compression algorithm
brew "lz4"
# General-purpose data compression with high compression ratio
brew "xz"
# TIFF library and utilities
brew "libtiff"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Command-line interface for SQLite
brew "sqlite"
# Download with resuming and segmented downloading
brew "aria2"
# Code searching, linting, rewriting
brew "ast-grep"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Software library to render fonts
brew "freetype"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# Multi-shell multi-command argument completer
brew "carapace"
# Binary installation for rust projects
brew "cargo-binstall"
# Change Source for every software on every platform from the command-line
brew "chsrc"
# Cut, copy, and paste anything, anywhere, all from the terminal
brew "clipboard"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Command-line DNS Client for Humans
brew "doggo"
# Pluggable and configurable code formatting platform written in Rust
brew "dprint"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Application-level logging library
brew "glog"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# OpenType text shaping engine
brew "harfbuzz"
# Sharp cut(1) clone
brew "hck"
# Command-line hex viewer
brew "hexyl"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Command-line pager for JSON data
brew "jless"
# Interactive JSON filter using jq
brew "jnv"
# JSON output from a shell
brew "jo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Common error values for all GnuPG components
brew "libgpg-error"
# Powerful, lightweight programming language
brew "lua"
# Rime Input Method Engine
brew "librime"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Drop-in replacement for MySQL
brew "mariadb"
# Mac App Store command-line interface
brew "mas"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Very basic terminfo library
brew "unibilium"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open source visual route tracking CLI tool
brew "nexttrace"
# Port scanning utility for large networks
brew "nmap"
# Unix command-line queue utility
brew "nq"
# Create, run, and share large language models (LLMs)
brew "ollama", link: false
# Command-line Git information tool
brew "onefetch"
# Painless compression and decompression for your terminal
brew "ouch"
# Shell command parallelization utility
brew "parallel"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm"
# Tool for managing OCI containers and pods
brew "podman"
# Modern replacement for ps written in Rust
brew "procs"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Implementation of Python 3 in Python
brew "pypy3.10"
# Core utilities for Python packages
brew "python-packaging"
# Persistent key-value database, with built-in net interface
brew "redis"
# Command-line tool to batch rename files and directories
brew "rnr"
# Utility that provides fast incremental file transfer
brew "rsync"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Run commands in parallel with Rust's Tokio framework
brew "rust-parallel"
# Rust toolchain installer
brew "rustup"
# Adds numbered shortcuts for common git commands
brew "scmpuff"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Human-friendly alternative to netstat for socket and port monitoring
brew "somo"
# High level, imperative, object-oriented programming language
brew "squirrel-lang"
# Cross-shell prompt for astronauts
brew "starship"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Open source continuous file synchronization application
brew "syncthing"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Incremental parsing library
brew "tree-sitter"
# Parser generator tool
brew "tree-sitter-cli"
# Alternative ssh client with additional features to meet your needs
brew "trzsz-ssh"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Platform for building proxies to bypass network restrictions
brew "v2ray"
# Version manager with support for Java, Node.js, Flutter, .NET & more
brew "vfox"
# Modern watch command
brew "viddy"
# Next generation frontend tooling. It's fast!
brew "vite"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# Platform for building proxies to bypass network restrictions
brew "xray"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Network scanner for Internet-wide network studies
brew "zmap"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Web-based GUI client of Project V
brew "v2raya/v2raya/v2raya"
# Enable Windows-like alt-tab
cask "alt-tab"
# Cloud storage service
cask "baidunetdisk"
# Desktop client that supports multiple LLM providers
cask "cherry-studio"
# AI assistant
cask "deepchat"
# Dictionary and translator app
cask "easydict"
# Screen colour temperature controller
cask "flux-app"
# Information browser
cask "folo"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf-cn"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Utility to provide quick look previews for files that aren't natively supported
cask "glance-chamburr"
# Desktop automation application
cask "hammerspoon"
# Free and open-source media player
cask "iina"
# Keyboard customiser
cask "karabiner-elements"
# Lunar calendar for menu bar
cask "lunarbar"
# Syncs files between computers and MEGA Cloud drives
cask "megasync"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Neovim Client
cask "neovide-app"
# Music streaming platform
cask "neteasemusic"
# Get up and running with large language models locally
cask "ollama-app"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Git GUI client
cask "sourcegit"
# Rime input method engine
cask "squirrel-app"
# System monitor for the menu bar
cask "stats"
# Real time file synchronisation software
cask "syncthing-app"
# Quicklook extension for source files
cask "syntax-highlight"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# 代理客户端，支持 Xray、sing-box 等
cask "brewforge/chinese/v2rayn"
# Gecko based web browser
cask "zen"
mas "Bob", id: 1630034110
mas "Picview", id: 6452016140
mas "QQ", id: 451108668
mas "百度网盘", id: 547166701
mas "腾讯会议", id: 1484048379
go "github.com/yassinebenaid/bunster/cmd/bunster"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/abice/go-enum"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "golang.org/x/tools/cmd/gorename"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "go.uber.org/mock/mockgen"
go "github.com/kyoh86/richgo"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "amber"
cargo "bat"
cargo "cargo-update"
cargo "dysk"
cargo "eza"
cargo "huniq"
cargo "pik"
cargo "ripgrep"
cargo "shimmy"
cargo "television"
cargo "viu"
cargo "vivid"
cargo "zawk"
