tap "daipeihust/tap"
tap "danvergara/tools"
tap "jstkdng/programs"
tap "laishulu/homebrew"
tap "lihaoyun6/tap"
tap "oven-sh/bun"
tap "pot-app/tap"
tap "umlx5h/tap"
tap "v2raya/v2raya"
tap "xo/xo"
tap "ybeapps/sourcegit"
# Extremely Fast Compression algorithm
brew "lz4"
# General-purpose data compression with high compression ratio
brew "xz"
# TIFF library and utilities
brew "libtiff"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Download with resuming and segmented downloading
brew "aria2"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Software library to render fonts
brew "freetype"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# Multi-shell multi-command argument completer
brew "carapace"
# Binary installation for rust projects
brew "cargo-binstall"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# OpenType text shaping engine
brew "harfbuzz"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Change Source for every software on every platform from the command-line
brew "chsrc"
# Cut, copy, and paste anything, anywhere, all from the terminal
brew "clipboard"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Command-line DNS Client for Humans
brew "doggo"
# Pluggable and configurable code formatting platform written in Rust
brew "dprint"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU compiler collection
brew "gcc"
# Tool to install, manage and use Progressive Web Apps in Mozilla Firefox
brew "firefoxpwa"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Common error values for all GnuPG components
brew "libgpg-error"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Sharp cut(1) clone
brew "hck"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Command-line hex viewer
brew "hexyl"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Command-line pager for JSON data
brew "jless"
# Interactive JSON filter using jq
brew "jnv"
# JSON output from a shell
brew "jo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Powerful, lightweight programming language
brew "lua"
# Rime Input Method Engine
brew "librime"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Unix documentation system
brew "man-db"
# Drop-in replacement for MySQL
brew "mariadb"
# Mac App Store command-line interface
brew "mas"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Very basic terminfo library
brew "unibilium"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open source visual route tracking CLI tool
brew "nexttrace"
# Port scanning utility for large networks
brew "nmap"
# Unix command-line queue utility
brew "nq"
# Command-line Git information tool
brew "onefetch"
# Painless compression and decompression for your terminal
brew "ouch"
# Shell command parallelization utility
brew "parallel"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Fast, disk space efficient package manager
brew "pnpm"
# Tool for managing OCI containers and pods
brew "podman"
# Modern replacement for ps written in Rust
brew "procs"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Implementation of Python 3 in Python
brew "pypy3.10"
# Core utilities for Python packages
brew "python-packaging"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line tool to batch rename files and directories
brew "rnr"
# Utility that provides fast incremental file transfer
brew "rsync"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Run commands in parallel with Rust's Tokio framework
brew "rust-parallel"
# Adds numbered shortcuts for common git commands
brew "scmpuff"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# High level, imperative, object-oriented programming language
brew "squirrel"
# Cross-shell prompt for astronauts
brew "starship"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Simple ssh client with trzsz ( trz / tsz ) support
brew "trzsz-ssh"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Platform for building proxies to bypass network restrictions
brew "v2ray"
# Version manager with support for Java, Node.js, Flutter, .NET & more
brew "vfox"
# Modern watch command
brew "viddy"
# Next generation frontend tooling. It's fast!
brew "vite"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# Platform for building proxies to bypass network restrictions
brew "xray"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Network scanner for Internet-wide network studies
brew "zmap"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Switch your input method through terminal
brew "daipeihust/tap/im-select"
# Drop in replacement for ueberzug written in C++
brew "jstkdng/programs/ueberzugpp"
# MacOS Input Source Manager
brew "laishulu/homebrew/macism"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# A Trash CLI manager written in Go
brew "umlx5h/tap/gtrash"
# Web-based GUI client of Project V
brew "v2raya/v2raya/v2raya"
# GPU-accelerated terminal emulator
cask "alacritty"
# Enable Windows-like alt-tab
cask "alt-tab"
# Cloud storage service
cask "baidunetdisk"
# Desktop client that supports multiple LLM providers
cask "cherry-studio"
# Dictionary and translator app
cask "easydict"
# Screen colour temperature controller
cask "flux"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf-cn"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Utility to provide quick look previews for files that aren't natively supported
cask "glance-chamburr"
# Desktop automation application
cask "hammerspoon"
# Free and open-source media player
cask "iina"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# Discover, download, and run local LLMs
cask "lm-studio"
# Lunar calendar for menu bar
cask "lunarbar"
# Syncs files between computers and MEGA Cloud drives
cask "megasync"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Neovim Client
cask "neovide"
# Music streaming platform
cask "neteasemusic"
# Get up and running with large language models locally
cask "ollama"
# Document editor
cask "onlyoffice"
# Screenshot tool
cask "pixpin"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Rime input method engine
cask "squirrel"
# System monitor for the menu bar
cask "stats"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Network protocol analyzer
cask "wireshark"
# Gecko based web browser
cask "zen-browser"
